#include<stdio.h>
int main() {
	int k,d;
	scanf("%d%d",&k,&d);
	//我需要分析一下，然后找一下规律！
	//5881
	//s(5881)=5+8+8+1=22
	//ss(22)=2+2
	//0->0
	//1->1
	//->1+0->10
	//1+9->19
	//2+8->28
	//3+4->34
	//4+6->46
	//5+5->55
	//6+4->64
	//7+3->73
	//8+2->82
	//9+1->91
	//1+1+8->118
	//逆向走可能性太多了！
	//d==k,k个1就可以
	//d>k,k-1个1,剩下的做为另一个数，就可以
	//d<k
	//4 4
	//1111
	//5 1 d=1,k=5
	//d=10,k=5处理
	//有办法了！
	int i;
	if(d==0){
		if(k==1){
			printf("0\n");
		}else{
			printf("No solution\n");
		}
	}else{
		//d大于等于k就够分了！
		while(1){
			if(d>=k)break;
			d=d*10;
		}
		printf("%d",d-(k-1));
		for(i=0;i<k-1;i++){
			printf("1");
		}
		printf("\n");
	}
	return 0;
}
